{"class_name": "Tokenizer", "config": {"num_words": 20000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 1400, "word_counts": "{\"attempt\": 299, \"start\": 95, \"task\": 61, \"m\": 328, \"address\": 337, \"change\": 337, \"detected\": 337, \"old\": 337, \"msra\": 813, \"sa\": 813, \"new\": 358, \"failed\": 234, \"to\": 435, \"renew\": 227, \"lease\": 227, \"for\": 513, \"dfsclient\": 227, \"nonmapreduce\": 227, \"seconds\": 227, \"will\": 227, \"retry\": 323, \"shortly\": 227, \"extract\": 1, \"jar\": 2, \"file\": 5, \"c\": 1, \"users\": 1, \"msrabi\": 1, \"appdata\": 1, \"local\": 1, \"temp\": 1, \"jetty\": 3, \"mapreduce\": 19, \"n\": 1, \"xum\": 1, \"webapp\": 1, \"reduce\": 91, \"slow\": 91, \"threshold\": 91, \"not\": 92, \"met\": 90, \"completedmapsforreduceslowstart\": 90, \"taskattempt\": 257, \"transitioned\": 53, \"from\": 61, \"unassigned\": 20, \"assigned\": 26, \"progress\": 207, \"of\": 210, \"is\": 307, \"jvm\": 28, \"with\": 15, \"id\": 17, \"asked\": 7, \"a\": 8, \"maxcontainercapability\": 1, \"memory\": 104, \"vcores\": 104, \"scheduled\": 18, \"snapshot\": 1, \"period\": 1, \"at\": 3, \"second\": 1, \"s\": 97, \"container\": 64, \"opening\": 10, \"proxy\": 10, \"fareast\": 51, \"corp\": 51, \"microsoft\": 51, \"com\": 51, \"processing\": 12, \"the\": 16, \"event\": 17, \"eventtype\": 16, \"remote\": 11, \"launch\": 7, \"got\": 7, \"allocated\": 7, \"containers\": 7, \"auth\": 16, \"successful\": 8, \"job\": 27, \"simple\": 8, \"recalculating\": 95, \"schedule\": 95, \"headroom\": 95, \"error\": 106, \"in\": 104, \"contacting\": 103, \"rm\": 105, \"resolved\": 32, \"given\": 7, \"adding\": 4, \"path\": 2, \"spec\": 2, \"starting\": 3, \"socket\": 5, \"reader\": 1, \"port\": 8, \"running\": 19, \"getresources\": 7, \"application\": 9, \"ask\": 7, \"release\": 7, \"newcontainers\": 7, \"finishedcontainers\": 7, \"resourcelimit\": 7, \"knownnms\": 7, \"all\": 2, \"maps\": 3, \"ramping\": 1, \"up\": 1, \"remaining\": 1, \"reduces\": 3, \"killing\": 1, \"retrying\": 96, \"connect\": 96, \"server\": 99, \"already\": 96, \"tried\": 96, \"time\": 96, \"policy\": 96, \"retryuptomaximumcountwithfixedsleep\": 96, \"maxretries\": 96, \"sleeptime\": 96, \"milliseconds\": 97, \"minint\": 15, \"fnanli\": 15, \"using\": 10, \"containerid\": 7, \"on\": 15, \"nm\": 7, \"blacklistdisablepercent\": 1, \"launching\": 8, \"created\": 1, \"mrappmaster\": 8, \"appattempt\": 1, \"complete\": 1, \"unknown\": 1, \"mapred\": 1, \"newapicommitter\": 1, \"dfsoutputstream\": 1, \"responseprocessor\": 1, \"exception\": 7, \"block\": 1, \"bp\": 1, \"blk\": 1, \"writer\": 1, \"setup\": 4, \"jobid\": 1, \"hdfs\": 4, \"registering\": 8, \"class\": 18, \"org\": 21, \"apache\": 18, \"hadoop\": 18, \"v\": 15, \"app\": 14, \"speculate\": 1, \"speculator\": 1, \"speculatoreventdispatcher\": 1, \"callqueue\": 2, \"java\": 10, \"util\": 2, \"concurrent\": 2, \"linkedblockingqueue\": 2, \"fail\": 4, \"cleanup\": 8, \"instantiated\": 1, \"mrclientservice\": 1, \"succeeded\": 3, \"after\": 5, \"scheduling\": 9, \"pendingreds\": 7, \"scheduledmaps\": 7, \"scheduledreds\": 7, \"assignedmaps\": 7, \"assignedreds\": 7, \"completedmaps\": 7, \"completedreds\": 7, \"contalloc\": 7, \"contrel\": 7, \"hostlocal\": 7, \"racklocal\": 7, \"jobhistory\": 2, \"jobhistoryeventhandler\": 1, \"upper\": 1, \"limit\": 1, \"thread\": 3, \"pool\": 1, \"size\": 2, \"dn\": 2, \"iq\": 2, \"received\": 2, \"completed\": 2, \"default\": 2, \"system\": 2, \"datastreamer\": 1, \"logging\": 1, \"slf\": 2, \"j\": 1, \"impl\": 1, \"log\": 3, \"jloggeradapter\": 1, \"mortbay\": 2, \"via\": 1, \"jlog\": 1, \"shuffle\": 7, \"returned\": 6, \"by\": 6, \"containermanager\": 6, \"number\": 2, \"fs\": 1, \"abort\": 1, \"normal\": 1, \"non\": 1, \"uberized\": 1, \"multi\": 1, \"reached\": 1, \"eventhandlingthread\": 1, \"main\": 1, \"threw\": 1, \"an\": 1, \"ipc\": 2, \"responder\": 1, \"bound\": 1, \"launcher\": 1, \"containerlauncher\": 1, \"containerlauncherrouter\": 1, \"token\": 3, \"jobtokensecretmanager\": 1, \"diagnostics\": 3, \"report\": 3, \"net\": 8, \"noroutetohostexception\": 8, \"no\": 12, \"route\": 8, \"host\": 8, \"timeout\": 4, \"further\": 4, \"information\": 4, \"more\": 4, \"details\": 4, \"see\": 4, \"http\": 4, \"added\": 1, \"list\": 1, \"uberizing\": 1, \"because\": 1, \"enabled\": 1, \"too\": 2, \"many\": 1, \"much\": 1, \"input\": 2, \"outputcommitter\": 1, \"lib\": 1, \"output\": 1, \"fileoutputcommitter\": 1, \"r\": 2, \"done\": 1, \"acknowledgement\": 1, \"inited\": 1, \"connecting\": 1, \"resourcemanager\": 1, \"failures\": 1, \"node\": 1, \"taskattempteventtype\": 1, \"taskattempteventdispatcher\": 1, \"kind\": 1, \"yarn\": 2, \"am\": 1, \"service\": 1, \"ident\": 1, \"appattemptid\": 1, \"cluster\": 1, \"timestamp\": 1, \"attemptid\": 1, \"keyid\": 1, \"client\": 1, \"max\": 1, \"cached\": 1, \"nodemanagers\": 1, \"proxies\": 1, \"listener\": 1, \"jobeventtype\": 1, \"jobeventdispatcher\": 1, \"nodeblacklistingenabled\": 1, \"true\": 1, \"redundant\": 1, \"we\": 1, \"launched\": 1, \"speculations\": 1, \"sleeping\": 1, \"putting\": 1, \"servicedata\": 1, \"splits\": 1, \"before\": 2, \"exited\": 1, \"success\": 1, \"protocol\": 1, \"api\": 1, \"mrclientprotocolpb\": 1, \"jobfinishevent\": 1, \"type\": 1, \"jobfinisheventhandler\": 1, \"containerallocator\": 1, \"containerallocatorrouter\": 1, \"commit\": 2, \"committereventtype\": 1, \"committereventhandler\": 1, \"reduceresourcerequest\": 1, \"started\": 1, \"httpserver\": 1, \"selectchannelconnectorwithsafestartup\": 1}", "word_docs": "{\"m\": 321, \"start\": 95, \"task\": 42, \"attempt\": 298, \"change\": 337, \"sa\": 476, \"msra\": 476, \"new\": 358, \"address\": 337, \"old\": 337, \"detected\": 337, \"renew\": 227, \"for\": 286, \"failed\": 234, \"will\": 227, \"nonmapreduce\": 227, \"shortly\": 227, \"seconds\": 227, \"dfsclient\": 227, \"retry\": 323, \"lease\": 227, \"to\": 427, \"temp\": 1, \"extract\": 1, \"mapreduce\": 11, \"xum\": 1, \"file\": 5, \"local\": 1, \"c\": 1, \"n\": 1, \"jetty\": 3, \"msrabi\": 1, \"jar\": 2, \"webapp\": 1, \"appdata\": 1, \"users\": 1, \"reduce\": 91, \"slow\": 91, \"met\": 90, \"threshold\": 91, \"not\": 91, \"completedmapsforreduceslowstart\": 90, \"assigned\": 26, \"taskattempt\": 257, \"transitioned\": 53, \"unassigned\": 20, \"from\": 58, \"is\": 307, \"progress\": 207, \"of\": 210, \"id\": 16, \"with\": 15, \"a\": 8, \"jvm\": 14, \"asked\": 7, \"maxcontainercapability\": 1, \"vcores\": 104, \"memory\": 104, \"at\": 3, \"second\": 1, \"period\": 1, \"s\": 97, \"snapshot\": 1, \"scheduled\": 18, \"container\": 32, \"fareast\": 51, \"com\": 51, \"opening\": 10, \"proxy\": 10, \"corp\": 51, \"microsoft\": 51, \"remote\": 11, \"eventtype\": 16, \"launch\": 7, \"the\": 15, \"processing\": 12, \"event\": 17, \"allocated\": 7, \"containers\": 7, \"got\": 7, \"simple\": 8, \"job\": 21, \"auth\": 8, \"successful\": 8, \"schedule\": 95, \"headroom\": 95, \"recalculating\": 95, \"contacting\": 103, \"in\": 104, \"error\": 106, \"rm\": 105, \"resolved\": 32, \"given\": 7, \"adding\": 4, \"path\": 2, \"spec\": 2, \"socket\": 5, \"reader\": 1, \"port\": 8, \"starting\": 3, \"running\": 19, \"finishedcontainers\": 7, \"application\": 9, \"newcontainers\": 7, \"resourcelimit\": 7, \"release\": 7, \"getresources\": 7, \"knownnms\": 7, \"ask\": 7, \"remaining\": 1, \"up\": 1, \"maps\": 3, \"ramping\": 1, \"all\": 1, \"reduces\": 3, \"killing\": 1, \"milliseconds\": 97, \"connect\": 96, \"policy\": 96, \"maxretries\": 96, \"sleeptime\": 96, \"tried\": 96, \"retrying\": 96, \"time\": 96, \"server\": 99, \"already\": 96, \"retryuptomaximumcountwithfixedsleep\": 96, \"minint\": 15, \"fnanli\": 15, \"using\": 10, \"on\": 15, \"nm\": 7, \"containerid\": 7, \"blacklistdisablepercent\": 1, \"launching\": 8, \"created\": 1, \"mrappmaster\": 8, \"appattempt\": 1, \"unknown\": 1, \"complete\": 1, \"newapicommitter\": 1, \"mapred\": 1, \"dfsoutputstream\": 1, \"exception\": 7, \"block\": 1, \"bp\": 1, \"blk\": 1, \"responseprocessor\": 1, \"setup\": 4, \"writer\": 1, \"jobid\": 1, \"hdfs\": 4, \"registering\": 8, \"v\": 8, \"class\": 10, \"org\": 11, \"app\": 7, \"apache\": 10, \"speculator\": 1, \"hadoop\": 10, \"speculatoreventdispatcher\": 1, \"speculate\": 1, \"java\": 6, \"util\": 2, \"callqueue\": 2, \"linkedblockingqueue\": 2, \"concurrent\": 2, \"cleanup\": 8, \"fail\": 4, \"instantiated\": 1, \"mrclientservice\": 1, \"succeeded\": 3, \"scheduling\": 9, \"scheduledmaps\": 7, \"pendingreds\": 7, \"completedmaps\": 7, \"hostlocal\": 7, \"assignedmaps\": 7, \"contalloc\": 7, \"assignedreds\": 7, \"scheduledreds\": 7, \"after\": 5, \"contrel\": 7, \"racklocal\": 7, \"completedreds\": 7, \"jobhistoryeventhandler\": 1, \"jobhistory\": 1, \"upper\": 1, \"pool\": 1, \"size\": 2, \"thread\": 2, \"limit\": 1, \"iq\": 2, \"dn\": 2, \"completed\": 2, \"received\": 2, \"default\": 2, \"system\": 2, \"datastreamer\": 1, \"jloggeradapter\": 1, \"via\": 1, \"j\": 1, \"log\": 1, \"jlog\": 1, \"impl\": 1, \"logging\": 1, \"mortbay\": 1, \"slf\": 1, \"by\": 6, \"returned\": 6, \"containermanager\": 6, \"shuffle\": 7, \"number\": 2, \"fs\": 1, \"abort\": 1, \"multi\": 1, \"uberized\": 1, \"non\": 1, \"normal\": 1, \"reached\": 1, \"threw\": 1, \"eventhandlingthread\": 1, \"main\": 1, \"an\": 1, \"responder\": 1, \"ipc\": 2, \"bound\": 1, \"launcher\": 1, \"containerlauncher\": 1, \"containerlauncherrouter\": 1, \"jobtokensecretmanager\": 1, \"token\": 3, \"see\": 4, \"further\": 4, \"details\": 4, \"information\": 4, \"net\": 4, \"http\": 4, \"noroutetohostexception\": 4, \"report\": 3, \"diagnostics\": 3, \"timeout\": 4, \"more\": 4, \"route\": 4, \"no\": 4, \"host\": 4, \"added\": 1, \"list\": 1, \"many\": 1, \"too\": 1, \"input\": 2, \"because\": 1, \"enabled\": 1, \"uberizing\": 1, \"much\": 1, \"lib\": 1, \"outputcommitter\": 1, \"fileoutputcommitter\": 1, \"output\": 1, \"r\": 2, \"acknowledgement\": 1, \"done\": 1, \"inited\": 1, \"resourcemanager\": 1, \"connecting\": 1, \"failures\": 1, \"node\": 1, \"taskattempteventdispatcher\": 1, \"taskattempteventtype\": 1, \"keyid\": 1, \"cluster\": 1, \"kind\": 1, \"yarn\": 2, \"attemptid\": 1, \"ident\": 1, \"service\": 1, \"am\": 1, \"timestamp\": 1, \"appattemptid\": 1, \"nodemanagers\": 1, \"max\": 1, \"proxies\": 1, \"cached\": 1, \"client\": 1, \"listener\": 1, \"jobeventdispatcher\": 1, \"jobeventtype\": 1, \"true\": 1, \"nodeblacklistingenabled\": 1, \"redundant\": 1, \"launched\": 1, \"we\": 1, \"sleeping\": 1, \"speculations\": 1, \"servicedata\": 1, \"putting\": 1, \"splits\": 1, \"before\": 2, \"exited\": 1, \"success\": 1, \"mrclientprotocolpb\": 1, \"api\": 1, \"protocol\": 1, \"jobfinisheventhandler\": 1, \"type\": 1, \"jobfinishevent\": 1, \"containerallocator\": 1, \"containerallocatorrouter\": 1, \"committereventtype\": 1, \"commit\": 1, \"committereventhandler\": 1, \"reduceresourcerequest\": 1, \"started\": 1, \"httpserver\": 1, \"selectchannelconnectorwithsafestartup\": 1}", "index_docs": "{\"11\": 321, \"44\": 95, \"55\": 42, \"14\": 298, \"8\": 337, \"3\": 476, \"2\": 476, \"6\": 358, \"7\": 337, \"10\": 337, \"9\": 337, \"17\": 227, \"4\": 286, \"16\": 234, \"22\": 227, \"20\": 227, \"23\": 227, \"21\": 227, \"19\": 227, \"12\": 323, \"18\": 227, \"5\": 427, \"194\": 1, \"188\": 1, \"68\": 11, \"196\": 1, \"137\": 5, \"193\": 1, \"189\": 1, \"195\": 1, \"151\": 3, \"191\": 1, \"162\": 2, \"197\": 1, \"192\": 1, \"190\": 1, \"49\": 91, \"50\": 91, \"52\": 90, \"51\": 91, \"48\": 91, \"53\": 90, \"65\": 26, \"15\": 257, \"57\": 53, \"67\": 20, \"56\": 58, \"13\": 307, \"25\": 207, \"24\": 210, \"74\": 16, \"79\": 15, \"94\": 8, \"63\": 14, \"106\": 7, \"198\": 1, \"29\": 104, \"28\": 104, \"152\": 3, \"201\": 1, \"200\": 1, \"33\": 97, \"199\": 1, \"70\": 18, \"54\": 32, \"58\": 51, \"61\": 51, \"88\": 10, \"89\": 10, \"59\": 51, \"60\": 51, \"87\": 11, \"77\": 16, \"107\": 7, \"76\": 15, \"85\": 12, \"75\": 17, \"109\": 7, \"110\": 7, \"108\": 7, \"96\": 8, \"64\": 21, \"78\": 8, \"95\": 8, \"46\": 95, \"47\": 95, \"45\": 95, \"31\": 103, \"30\": 104, \"26\": 106, \"27\": 105, \"62\": 32, \"111\": 7, \"140\": 4, \"163\": 2, \"164\": 2, \"138\": 5, \"202\": 1, \"97\": 8, \"153\": 3, \"69\": 19, \"116\": 7, \"92\": 9, \"115\": 7, \"117\": 7, \"114\": 7, \"112\": 7, \"118\": 7, \"113\": 7, \"205\": 1, \"204\": 1, \"154\": 3, \"203\": 1, \"165\": 1, \"155\": 3, \"206\": 1, \"34\": 97, \"36\": 96, \"40\": 96, \"42\": 96, \"43\": 96, \"38\": 96, \"35\": 96, \"39\": 96, \"32\": 99, \"37\": 96, \"41\": 96, \"80\": 15, \"81\": 15, \"90\": 10, \"82\": 15, \"120\": 7, \"119\": 7, \"207\": 1, \"98\": 8, \"208\": 1, \"99\": 8, \"209\": 1, \"211\": 1, \"210\": 1, \"213\": 1, \"212\": 1, \"214\": 1, \"121\": 7, \"216\": 1, \"217\": 1, \"218\": 1, \"215\": 1, \"141\": 4, \"219\": 1, \"220\": 1, \"142\": 4, \"100\": 8, \"83\": 8, \"71\": 10, \"66\": 11, \"84\": 7, \"72\": 10, \"222\": 1, \"73\": 10, \"223\": 1, \"221\": 1, \"91\": 6, \"167\": 2, \"166\": 2, \"169\": 2, \"168\": 2, \"101\": 8, \"143\": 4, \"224\": 1, \"225\": 1, \"156\": 3, \"93\": 9, \"123\": 7, \"122\": 7, \"127\": 7, \"131\": 7, \"125\": 7, \"129\": 7, \"126\": 7, \"124\": 7, \"139\": 5, \"130\": 7, \"132\": 7, \"128\": 7, \"226\": 1, \"170\": 1, \"227\": 1, \"229\": 1, \"171\": 2, \"157\": 2, \"228\": 1, \"173\": 2, \"172\": 2, \"175\": 2, \"174\": 2, \"176\": 2, \"177\": 2, \"230\": 1, \"234\": 1, \"235\": 1, \"232\": 1, \"158\": 1, \"236\": 1, \"233\": 1, \"231\": 1, \"179\": 1, \"178\": 1, \"135\": 6, \"134\": 6, \"136\": 6, \"133\": 7, \"180\": 2, \"237\": 1, \"238\": 1, \"242\": 1, \"241\": 1, \"240\": 1, \"239\": 1, \"243\": 1, \"246\": 1, \"244\": 1, \"245\": 1, \"247\": 1, \"248\": 1, \"181\": 2, \"249\": 1, \"250\": 1, \"251\": 1, \"252\": 1, \"253\": 1, \"159\": 3, \"149\": 4, \"145\": 4, \"148\": 4, \"146\": 4, \"102\": 4, \"150\": 4, \"103\": 4, \"161\": 3, \"160\": 3, \"144\": 4, \"147\": 4, \"104\": 4, \"86\": 4, \"105\": 4, \"254\": 1, \"255\": 1, \"259\": 1, \"182\": 1, \"183\": 2, \"257\": 1, \"258\": 1, \"256\": 1, \"260\": 1, \"262\": 1, \"261\": 1, \"264\": 1, \"263\": 1, \"184\": 2, \"266\": 1, \"265\": 1, \"267\": 1, \"269\": 1, \"268\": 1, \"270\": 1, \"271\": 1, \"273\": 1, \"272\": 1, \"282\": 1, \"279\": 1, \"274\": 1, \"185\": 2, \"281\": 1, \"277\": 1, \"276\": 1, \"275\": 1, \"280\": 1, \"278\": 1, \"286\": 1, \"284\": 1, \"287\": 1, \"285\": 1, \"283\": 1, \"288\": 1, \"290\": 1, \"289\": 1, \"292\": 1, \"291\": 1, \"293\": 1, \"295\": 1, \"294\": 1, \"297\": 1, \"296\": 1, \"299\": 1, \"298\": 1, \"300\": 1, \"186\": 2, \"301\": 1, \"302\": 1, \"305\": 1, \"304\": 1, \"303\": 1, \"308\": 1, \"307\": 1, \"306\": 1, \"309\": 1, \"310\": 1, \"311\": 1, \"187\": 1, \"312\": 1, \"313\": 1, \"314\": 1, \"315\": 1, \"316\": 1}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"msra\", \"3\": \"sa\", \"4\": \"for\", \"5\": \"to\", \"6\": \"new\", \"7\": \"address\", \"8\": \"change\", \"9\": \"detected\", \"10\": \"old\", \"11\": \"m\", \"12\": \"retry\", \"13\": \"is\", \"14\": \"attempt\", \"15\": \"taskattempt\", \"16\": \"failed\", \"17\": \"renew\", \"18\": \"lease\", \"19\": \"dfsclient\", \"20\": \"nonmapreduce\", \"21\": \"seconds\", \"22\": \"will\", \"23\": \"shortly\", \"24\": \"of\", \"25\": \"progress\", \"26\": \"error\", \"27\": \"rm\", \"28\": \"memory\", \"29\": \"vcores\", \"30\": \"in\", \"31\": \"contacting\", \"32\": \"server\", \"33\": \"s\", \"34\": \"milliseconds\", \"35\": \"retrying\", \"36\": \"connect\", \"37\": \"already\", \"38\": \"tried\", \"39\": \"time\", \"40\": \"policy\", \"41\": \"retryuptomaximumcountwithfixedsleep\", \"42\": \"maxretries\", \"43\": \"sleeptime\", \"44\": \"start\", \"45\": \"recalculating\", \"46\": \"schedule\", \"47\": \"headroom\", \"48\": \"not\", \"49\": \"reduce\", \"50\": \"slow\", \"51\": \"threshold\", \"52\": \"met\", \"53\": \"completedmapsforreduceslowstart\", \"54\": \"container\", \"55\": \"task\", \"56\": \"from\", \"57\": \"transitioned\", \"58\": \"fareast\", \"59\": \"corp\", \"60\": \"microsoft\", \"61\": \"com\", \"62\": \"resolved\", \"63\": \"jvm\", \"64\": \"job\", \"65\": \"assigned\", \"66\": \"org\", \"67\": \"unassigned\", \"68\": \"mapreduce\", \"69\": \"running\", \"70\": \"scheduled\", \"71\": \"class\", \"72\": \"apache\", \"73\": \"hadoop\", \"74\": \"id\", \"75\": \"event\", \"76\": \"the\", \"77\": \"eventtype\", \"78\": \"auth\", \"79\": \"with\", \"80\": \"minint\", \"81\": \"fnanli\", \"82\": \"on\", \"83\": \"v\", \"84\": \"app\", \"85\": \"processing\", \"86\": \"no\", \"87\": \"remote\", \"88\": \"opening\", \"89\": \"proxy\", \"90\": \"using\", \"91\": \"java\", \"92\": \"application\", \"93\": \"scheduling\", \"94\": \"a\", \"95\": \"successful\", \"96\": \"simple\", \"97\": \"port\", \"98\": \"launching\", \"99\": \"mrappmaster\", \"100\": \"registering\", \"101\": \"cleanup\", \"102\": \"net\", \"103\": \"noroutetohostexception\", \"104\": \"route\", \"105\": \"host\", \"106\": \"asked\", \"107\": \"launch\", \"108\": \"got\", \"109\": \"allocated\", \"110\": \"containers\", \"111\": \"given\", \"112\": \"getresources\", \"113\": \"ask\", \"114\": \"release\", \"115\": \"newcontainers\", \"116\": \"finishedcontainers\", \"117\": \"resourcelimit\", \"118\": \"knownnms\", \"119\": \"containerid\", \"120\": \"nm\", \"121\": \"exception\", \"122\": \"pendingreds\", \"123\": \"scheduledmaps\", \"124\": \"scheduledreds\", \"125\": \"assignedmaps\", \"126\": \"assignedreds\", \"127\": \"completedmaps\", \"128\": \"completedreds\", \"129\": \"contalloc\", \"130\": \"contrel\", \"131\": \"hostlocal\", \"132\": \"racklocal\", \"133\": \"shuffle\", \"134\": \"returned\", \"135\": \"by\", \"136\": \"containermanager\", \"137\": \"file\", \"138\": \"socket\", \"139\": \"after\", \"140\": \"adding\", \"141\": \"setup\", \"142\": \"hdfs\", \"143\": \"fail\", \"144\": \"timeout\", \"145\": \"further\", \"146\": \"information\", \"147\": \"more\", \"148\": \"details\", \"149\": \"see\", \"150\": \"http\", \"151\": \"jetty\", \"152\": \"at\", \"153\": \"starting\", \"154\": \"maps\", \"155\": \"reduces\", \"156\": \"succeeded\", \"157\": \"thread\", \"158\": \"log\", \"159\": \"token\", \"160\": \"diagnostics\", \"161\": \"report\", \"162\": \"jar\", \"163\": \"path\", \"164\": \"spec\", \"165\": \"all\", \"166\": \"callqueue\", \"167\": \"util\", \"168\": \"concurrent\", \"169\": \"linkedblockingqueue\", \"170\": \"jobhistory\", \"171\": \"size\", \"172\": \"dn\", \"173\": \"iq\", \"174\": \"received\", \"175\": \"completed\", \"176\": \"default\", \"177\": \"system\", \"178\": \"slf\", \"179\": \"mortbay\", \"180\": \"number\", \"181\": \"ipc\", \"182\": \"too\", \"183\": \"input\", \"184\": \"r\", \"185\": \"yarn\", \"186\": \"before\", \"187\": \"commit\", \"188\": \"extract\", \"189\": \"c\", \"190\": \"users\", \"191\": \"msrabi\", \"192\": \"appdata\", \"193\": \"local\", \"194\": \"temp\", \"195\": \"n\", \"196\": \"xum\", \"197\": \"webapp\", \"198\": \"maxcontainercapability\", \"199\": \"snapshot\", \"200\": \"period\", \"201\": \"second\", \"202\": \"reader\", \"203\": \"ramping\", \"204\": \"up\", \"205\": \"remaining\", \"206\": \"killing\", \"207\": \"blacklistdisablepercent\", \"208\": \"created\", \"209\": \"appattempt\", \"210\": \"complete\", \"211\": \"unknown\", \"212\": \"mapred\", \"213\": \"newapicommitter\", \"214\": \"dfsoutputstream\", \"215\": \"responseprocessor\", \"216\": \"block\", \"217\": \"bp\", \"218\": \"blk\", \"219\": \"writer\", \"220\": \"jobid\", \"221\": \"speculate\", \"222\": \"speculator\", \"223\": \"speculatoreventdispatcher\", \"224\": \"instantiated\", \"225\": \"mrclientservice\", \"226\": \"jobhistoryeventhandler\", \"227\": \"upper\", \"228\": \"limit\", \"229\": \"pool\", \"230\": \"datastreamer\", \"231\": \"logging\", \"232\": \"j\", \"233\": \"impl\", \"234\": \"jloggeradapter\", \"235\": \"via\", \"236\": \"jlog\", \"237\": \"fs\", \"238\": \"abort\", \"239\": \"normal\", \"240\": \"non\", \"241\": \"uberized\", \"242\": \"multi\", \"243\": \"reached\", \"244\": \"eventhandlingthread\", \"245\": \"main\", \"246\": \"threw\", \"247\": \"an\", \"248\": \"responder\", \"249\": \"bound\", \"250\": \"launcher\", \"251\": \"containerlauncher\", \"252\": \"containerlauncherrouter\", \"253\": \"jobtokensecretmanager\", \"254\": \"added\", \"255\": \"list\", \"256\": \"uberizing\", \"257\": \"because\", \"258\": \"enabled\", \"259\": \"many\", \"260\": \"much\", \"261\": \"outputcommitter\", \"262\": \"lib\", \"263\": \"output\", \"264\": \"fileoutputcommitter\", \"265\": \"done\", \"266\": \"acknowledgement\", \"267\": \"inited\", \"268\": \"connecting\", \"269\": \"resourcemanager\", \"270\": \"failures\", \"271\": \"node\", \"272\": \"taskattempteventtype\", \"273\": \"taskattempteventdispatcher\", \"274\": \"kind\", \"275\": \"am\", \"276\": \"service\", \"277\": \"ident\", \"278\": \"appattemptid\", \"279\": \"cluster\", \"280\": \"timestamp\", \"281\": \"attemptid\", \"282\": \"keyid\", \"283\": \"client\", \"284\": \"max\", \"285\": \"cached\", \"286\": \"nodemanagers\", \"287\": \"proxies\", \"288\": \"listener\", \"289\": \"jobeventtype\", \"290\": \"jobeventdispatcher\", \"291\": \"nodeblacklistingenabled\", \"292\": \"true\", \"293\": \"redundant\", \"294\": \"we\", \"295\": \"launched\", \"296\": \"speculations\", \"297\": \"sleeping\", \"298\": \"putting\", \"299\": \"servicedata\", \"300\": \"splits\", \"301\": \"exited\", \"302\": \"success\", \"303\": \"protocol\", \"304\": \"api\", \"305\": \"mrclientprotocolpb\", \"306\": \"jobfinishevent\", \"307\": \"type\", \"308\": \"jobfinisheventhandler\", \"309\": \"containerallocator\", \"310\": \"containerallocatorrouter\", \"311\": \"committereventtype\", \"312\": \"committereventhandler\", \"313\": \"reduceresourcerequest\", \"314\": \"started\", \"315\": \"httpserver\", \"316\": \"selectchannelconnectorwithsafestartup\"}", "word_index": "{\"<OOV>\": 1, \"msra\": 2, \"sa\": 3, \"for\": 4, \"to\": 5, \"new\": 6, \"address\": 7, \"change\": 8, \"detected\": 9, \"old\": 10, \"m\": 11, \"retry\": 12, \"is\": 13, \"attempt\": 14, \"taskattempt\": 15, \"failed\": 16, \"renew\": 17, \"lease\": 18, \"dfsclient\": 19, \"nonmapreduce\": 20, \"seconds\": 21, \"will\": 22, \"shortly\": 23, \"of\": 24, \"progress\": 25, \"error\": 26, \"rm\": 27, \"memory\": 28, \"vcores\": 29, \"in\": 30, \"contacting\": 31, \"server\": 32, \"s\": 33, \"milliseconds\": 34, \"retrying\": 35, \"connect\": 36, \"already\": 37, \"tried\": 38, \"time\": 39, \"policy\": 40, \"retryuptomaximumcountwithfixedsleep\": 41, \"maxretries\": 42, \"sleeptime\": 43, \"start\": 44, \"recalculating\": 45, \"schedule\": 46, \"headroom\": 47, \"not\": 48, \"reduce\": 49, \"slow\": 50, \"threshold\": 51, \"met\": 52, \"completedmapsforreduceslowstart\": 53, \"container\": 54, \"task\": 55, \"from\": 56, \"transitioned\": 57, \"fareast\": 58, \"corp\": 59, \"microsoft\": 60, \"com\": 61, \"resolved\": 62, \"jvm\": 63, \"job\": 64, \"assigned\": 65, \"org\": 66, \"unassigned\": 67, \"mapreduce\": 68, \"running\": 69, \"scheduled\": 70, \"class\": 71, \"apache\": 72, \"hadoop\": 73, \"id\": 74, \"event\": 75, \"the\": 76, \"eventtype\": 77, \"auth\": 78, \"with\": 79, \"minint\": 80, \"fnanli\": 81, \"on\": 82, \"v\": 83, \"app\": 84, \"processing\": 85, \"no\": 86, \"remote\": 87, \"opening\": 88, \"proxy\": 89, \"using\": 90, \"java\": 91, \"application\": 92, \"scheduling\": 93, \"a\": 94, \"successful\": 95, \"simple\": 96, \"port\": 97, \"launching\": 98, \"mrappmaster\": 99, \"registering\": 100, \"cleanup\": 101, \"net\": 102, \"noroutetohostexception\": 103, \"route\": 104, \"host\": 105, \"asked\": 106, \"launch\": 107, \"got\": 108, \"allocated\": 109, \"containers\": 110, \"given\": 111, \"getresources\": 112, \"ask\": 113, \"release\": 114, \"newcontainers\": 115, \"finishedcontainers\": 116, \"resourcelimit\": 117, \"knownnms\": 118, \"containerid\": 119, \"nm\": 120, \"exception\": 121, \"pendingreds\": 122, \"scheduledmaps\": 123, \"scheduledreds\": 124, \"assignedmaps\": 125, \"assignedreds\": 126, \"completedmaps\": 127, \"completedreds\": 128, \"contalloc\": 129, \"contrel\": 130, \"hostlocal\": 131, \"racklocal\": 132, \"shuffle\": 133, \"returned\": 134, \"by\": 135, \"containermanager\": 136, \"file\": 137, \"socket\": 138, \"after\": 139, \"adding\": 140, \"setup\": 141, \"hdfs\": 142, \"fail\": 143, \"timeout\": 144, \"further\": 145, \"information\": 146, \"more\": 147, \"details\": 148, \"see\": 149, \"http\": 150, \"jetty\": 151, \"at\": 152, \"starting\": 153, \"maps\": 154, \"reduces\": 155, \"succeeded\": 156, \"thread\": 157, \"log\": 158, \"token\": 159, \"diagnostics\": 160, \"report\": 161, \"jar\": 162, \"path\": 163, \"spec\": 164, \"all\": 165, \"callqueue\": 166, \"util\": 167, \"concurrent\": 168, \"linkedblockingqueue\": 169, \"jobhistory\": 170, \"size\": 171, \"dn\": 172, \"iq\": 173, \"received\": 174, \"completed\": 175, \"default\": 176, \"system\": 177, \"slf\": 178, \"mortbay\": 179, \"number\": 180, \"ipc\": 181, \"too\": 182, \"input\": 183, \"r\": 184, \"yarn\": 185, \"before\": 186, \"commit\": 187, \"extract\": 188, \"c\": 189, \"users\": 190, \"msrabi\": 191, \"appdata\": 192, \"local\": 193, \"temp\": 194, \"n\": 195, \"xum\": 196, \"webapp\": 197, \"maxcontainercapability\": 198, \"snapshot\": 199, \"period\": 200, \"second\": 201, \"reader\": 202, \"ramping\": 203, \"up\": 204, \"remaining\": 205, \"killing\": 206, \"blacklistdisablepercent\": 207, \"created\": 208, \"appattempt\": 209, \"complete\": 210, \"unknown\": 211, \"mapred\": 212, \"newapicommitter\": 213, \"dfsoutputstream\": 214, \"responseprocessor\": 215, \"block\": 216, \"bp\": 217, \"blk\": 218, \"writer\": 219, \"jobid\": 220, \"speculate\": 221, \"speculator\": 222, \"speculatoreventdispatcher\": 223, \"instantiated\": 224, \"mrclientservice\": 225, \"jobhistoryeventhandler\": 226, \"upper\": 227, \"limit\": 228, \"pool\": 229, \"datastreamer\": 230, \"logging\": 231, \"j\": 232, \"impl\": 233, \"jloggeradapter\": 234, \"via\": 235, \"jlog\": 236, \"fs\": 237, \"abort\": 238, \"normal\": 239, \"non\": 240, \"uberized\": 241, \"multi\": 242, \"reached\": 243, \"eventhandlingthread\": 244, \"main\": 245, \"threw\": 246, \"an\": 247, \"responder\": 248, \"bound\": 249, \"launcher\": 250, \"containerlauncher\": 251, \"containerlauncherrouter\": 252, \"jobtokensecretmanager\": 253, \"added\": 254, \"list\": 255, \"uberizing\": 256, \"because\": 257, \"enabled\": 258, \"many\": 259, \"much\": 260, \"outputcommitter\": 261, \"lib\": 262, \"output\": 263, \"fileoutputcommitter\": 264, \"done\": 265, \"acknowledgement\": 266, \"inited\": 267, \"connecting\": 268, \"resourcemanager\": 269, \"failures\": 270, \"node\": 271, \"taskattempteventtype\": 272, \"taskattempteventdispatcher\": 273, \"kind\": 274, \"am\": 275, \"service\": 276, \"ident\": 277, \"appattemptid\": 278, \"cluster\": 279, \"timestamp\": 280, \"attemptid\": 281, \"keyid\": 282, \"client\": 283, \"max\": 284, \"cached\": 285, \"nodemanagers\": 286, \"proxies\": 287, \"listener\": 288, \"jobeventtype\": 289, \"jobeventdispatcher\": 290, \"nodeblacklistingenabled\": 291, \"true\": 292, \"redundant\": 293, \"we\": 294, \"launched\": 295, \"speculations\": 296, \"sleeping\": 297, \"putting\": 298, \"servicedata\": 299, \"splits\": 300, \"exited\": 301, \"success\": 302, \"protocol\": 303, \"api\": 304, \"mrclientprotocolpb\": 305, \"jobfinishevent\": 306, \"type\": 307, \"jobfinisheventhandler\": 308, \"containerallocator\": 309, \"containerallocatorrouter\": 310, \"committereventtype\": 311, \"committereventhandler\": 312, \"reduceresourcerequest\": 313, \"started\": 314, \"httpserver\": 315, \"selectchannelconnectorwithsafestartup\": 316}"}}